import requests

# Wdの変換表
wd_mapping = {
    100: "晴れ",
    101: "晴れ 時々 くもり",
    102: "晴れ 一時 雨",
    103: "晴れ 時々 雨",
    104: "晴れ 一時 雪",
    105: "晴れ 時々 雪",
    106: "晴れ 一時 雨か雪",
    107: "晴れ 時々 雨か雪",
    108: "晴れ 一時 雨か雷雨",
    110: "晴れ のち時々くもり",
    111: "晴れ のち くもり",
    112: "晴れ のち一時 雨",
    113: "晴れ のち時々 雨",
    114: "晴れ のち 雨",
    115: "晴れ のち一時 雪",
    116: "晴れ のち時々 雪",
    117: "晴れ のち 雪",
    118: "晴れ のち 雨か雪",
    119: "晴れ のち 雨か雷雨",
    120: "晴れ 朝夕 一時 雨",
    121: "晴れ 朝の内一時 雨",
    122: "晴れ 夕方一時 雨",
    123: "晴れ 山沿い 雷雨",
    124: "晴れ 山沿い 雪",
    125: "晴れ 午後は雷雨",
    126: "晴れ 昼頃から雨",
    127: "晴れ 夕方から雨",
    128: "晴れ 夜は雨",
    129: "晴れ 夜半から雨",
    130: "朝の内 霧 後 晴れ",
    131: "晴れ 明け方 霧",
    132: "晴れ 朝夕 くもり",
    140: "晴れ 時々 雨で雷を伴う",
    160: "晴れ 一時 雪か雨",
    170: "晴れ 時々 雪か雨",
    181: "晴れ のち 雪か雨",
    200: "くもり",
    201: "くもり 時々 晴れ",
    202: "くもり 一時 雨",
    203: "くもり 時々 雨",
    204: "くもり 一時 雪",
    205: "くもり 時々 雪",
    206: "くもり 一時 雨か雪",
    207: "くもり 時々 雨か雪",
    208: "くもり 一時 雨か雷雨",
    209: "霧",
    210: "くもり のち時々 晴れ",
    211: "くもり のち 晴れ",
    212: "くもり のち一時 雨",
    213: "くもり のち時々 雨",
    214: "くもり のち 雨",
    215: "くもり のち一時 雪",
    216: "くもり のち時々 雪",
    217: "くもり のち 雪",
    218: "くもり のち 雨か雪",
    219: "くもり のち 雨か雷雨",
    220: "くもり 朝夕一時 雨",
    221: "くもり 朝の内一時 雨",
    222: "くもり 夕方一時 雨",
    223: "くもり 日中時々 晴れ",
    224: "くもり 昼頃から雨",
    225: "くもり 夕方から雨",
    226: "くもり 夜は雨",
    227: "くもり 夜半から雨",
    228: "くもり 昼頃から雪",
    229: "くもり 夕方から雪",
    230: "くもり 夜は雪",
    231: "くもり海上海岸は霧か霧雨",
    240: "くもり 時々雨で 雷を伴う",
    250: "くもり 時々雪で 雷を伴う",
    260: "くもり 一時 雪か雨",
    270: "くもり 時々 雪か雨",
    281: "くもり のち 雪か雨",
    300: "雨",
    301: "雨 時々 晴れ",
    302: "雨 時々 止む",
    303: "雨 時々 雪",
    304: "雨か雪",
    306: "大雨",
    307: "風雨共に強い",
    308: "雨で暴風を伴う",
    309: "雨 一時 雪",
    311: "雨 のち 晴れ",
    313: "雨 のち くもり",
    314: "雨 のち時々 雪",
    315: "雨 のち 雪",
    316: "雨か雪 のち 晴れ",
    317: "雨か雪 のち くもり",
    320: "朝の内雨 のち 晴れ",
    321: "朝の内雨 のち くもり",
    322: "雨 朝晩一時 雪",
    323: "雨 昼頃から 晴れ",
    324: "雨 夕方から 晴れ",
    325: "雨 夜は晴",
    326: "雨 夕方から雪",
    327: "雨 夜は雪",
    328: "雨 一時強く降る",
    329: "雨 一時 みぞれ",
    340: "雪か雨",
    350: "雨で雷を伴う",
    361: "雪か雨 のち 晴れ",
    371: "雪か雨 のち くもり",
    400: "雪",
    401: "雪 時々 晴れ",
    402: "雪 時々止む",
    403: "雪 時々 雨",
    405: "大雪",
    406: "風雪強い",
    407: "暴風雪",
    409: "雪 一時 雨",
    411: "雪 のち 晴れ",
    413: "雪 のち くもり",
    414: "雪 のち 雨",
    420: "朝の内雪 のち 晴れ",
    421: "朝の内雪 のち くもり",
    422: "雪 昼頃から雨",
    423: "雪 夕方から雨",
    424: "雪 夜半から雨",
    425: "雪 一時強く降る",
    426: "雪 のち みぞれ",
    427: "雪 一時 みぞれ",
    450: "雪で雷を伴う",
}


# Wsの変換表
ws_mapping = {
    10: "快晴",
    20: "晴れ時々曇り",
    21: "晴れ時々曇り(雨の可能性あり)",
    24: "晴れ時々曇り(雷の可能性あり)",
    30: "曇り",
    31: "曇り(雨の可能性あり)",
    34: "曇り(雷の可能性あり)",
    41: "曇り時々雨",
    42: "曇り時々みぞれ",
    43: "曇り時々雪",
    51: "雨",
    52: "みぞれ",
    53: "雪",
    54: "雨(雷を伴う)",
    55: "みぞれ(雷を伴う)",
    56: "雪(雷を伴う)",
    61: "強い雨",
    63: "強い雪",
    64: "強い雨(雷を伴う)",
    66: "強い雪(雷を伴う)",
    71: "大雨",
    73: "大雪",
    74: "大雨(雷を伴う)",
    76: "大雪(雷を伴う)",
    81: "暴風雨",
    83: "吹雪",
    84: "暴風雨(雷を伴う)",
    86: "吹雪(雷を伴う)",
}


# 時間帯のリスト
time_periods = [
    "未明",
    "明け方",
    "朝",
    "昼前",
    "昼過ぎ",
    "夕方",
    "夜のはじめ頃",
    "夜遅く",
]


def get_weather_day(moji_data_list):
    for item in moji_data_list:
        if item is not None:
            # Wdの数値を文字列に変換
            wd_code = item.get("Wd")
            wd_text = wd_mapping.get(wd_code, "不明")
            item["Wd_text"] = wd_text

            # Wsの数値を文字列に変換
            ws_codes = item.get("Ws", [])
            ws_text_list = []
            for i, code in enumerate(ws_codes):
                time_period = (
                    time_periods[i] if i < len(time_periods) else "不明な時間帯"
                )
                weather_text = ws_mapping.get(code, "不明")
                ws_text_list.append({"time": time_period, "weather": weather_text})
            item["Ws_text"] = ws_text_list

            # importanceの計算（ここでは仮に1を設定）
            information = 1
            impact = 0
            importance = information + impact
            item["importance"] = importance
    return moji_data_list


def get_moji_list(moji):
    if isinstance(moji, list):
        return moji
    elif isinstance(moji, dict):
        moji_list = [moji[key] for key in sorted(moji.keys(), key=lambda x: int(x))]
        return moji_list
    else:
        return []


# Mojiデータを取得する関数
def get_moji_data(point: str, ann: str):
    try:
        # URLをフォーマットしてリクエストを送信
        url = f"https://hima.weathermap.co.jp/work/moji/get.php?P={point}&ann={ann}"
        response = requests.get(url)
        response.raise_for_status()  # HTTPエラーチェック

        # レスポンスデータを表示（JSONフォーマット）
        moji_data = response.json()
        # print("Moji Data:", json.dumps(moji_data, ensure_ascii=False, indent=2))

        return moji_data

    except requests.exceptions.RequestException as e:
        print(f"Moji Data取得エラー: {e}")
        return None
